---
kind: property
id: P:Autodesk.Revit.DB.Curve.Period
zh: 曲线
source: html/30b0f487-7728-9617-be52-616ca42da762.htm
---
# Autodesk.Revit.DB.Curve.Period Property

**中文**: 曲线

The period of this curve.

## Syntax (C#)
```csharp
public double Period { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the curve is not cyclic.